; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-28)
(:domain gripper-strips)
(:objects rooma roomb room3 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 )
(:init
(room rooma)
(room roomb)
(room room3)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 19 of 28
2. (pick ball9 roomb left)
   deleted: (at ball9 roomb) (free left)
   added: (carry ball9 left)
   goals met: 19 of 28
3. (pick ball8 roomb right)
   deleted: (at ball8 roomb) (free right)
   added: (carry ball8 right)
   goals met: 19 of 28
4. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 19 of 28
5. (drop ball8 rooma right)
   deleted: (carry ball8 right)
   added: (at ball8 rooma) (free right)
   goals met: 20 of 28
6. (drop ball9 rooma left)
   deleted: (carry ball9 left)
   added: (at ball9 rooma) (free left)
   goals met: 21 of 28
7. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 21 of 28
8. (pick ball14 roomb left)
   deleted: (at ball14 roomb) (free left)
   added: (carry ball14 left)
   goals met: 21 of 28
9. (pick ball13 roomb right)
   deleted: (at ball13 roomb) (free right)
   added: (carry ball13 right)
   goals met: 21 of 28
10. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 21 of 28
11. (drop ball13 rooma right)
   deleted: (carry ball13 right)
   added: (at ball13 rooma) (free right)
   goals met: 22 of 28
12. (drop ball14 rooma left)
   deleted: (carry ball14 left)
   added: (at ball14 rooma) (free left)
   goals met: 23 of 28
13. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 23 of 28
14. (pick ball12 roomb left)
   deleted: (at ball12 roomb) (free left)
   added: (carry ball12 left)
   goals met: 23 of 28
15. (pick ball11 roomb right)
   deleted: (at ball11 roomb) (free right)
   added: (carry ball11 right)
   goals met: 23 of 28
16. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 23 of 28
17. (drop ball11 rooma right)
   deleted: (carry ball11 right)
   added: (at ball11 rooma) (free right)
   goals met: 24 of 28
18. (drop ball12 rooma left)
   deleted: (carry ball12 left)
   added: (at ball12 rooma) (free left)
   goals met: 25 of 28
19. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 25 of 28
20. (pick ball10 roomb left)
   deleted: (at ball10 roomb) (free left)
   added: (carry ball10 left)
   goals met: 25 of 28
21. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 25 of 28
22. (drop ball10 rooma left)
   deleted: (carry ball10 left)
   added: (at ball10 rooma) (free left)
   goals met: 26 of 28
23. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 26 of 28
24. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 26 of 28
25. (pick ball18 room3 left)
   deleted: (at ball18 room3) (free left)
   added: (carry ball18 left)
   goals met: 26 of 28
26. (pick ball17 room3 right)
   deleted: (at ball17 room3) (free right)
   added: (carry ball17 right)
   goals met: 26 of 28
27. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 26 of 28
28. (drop ball18 roomb left)
   deleted: (carry ball18 left)
   added: (at ball18 roomb) (free left)
   goals met: 27 of 28
29. (drop ball17 roomb right)
   deleted: (carry ball17 right)
   added: (at ball17 roomb) (free right)
   goals met: 28 of 28
